import bcrypt from 'bcryptjs';

const data = {
    users: [
        {
          name: 'Nirit',
          email: 'admin@example.com',
          password: bcrypt.hashSync('4567', 8),
          isAdmin: true,          
        },
        {
          name: 'John',
          email: 'user@example.com',
          password: bcrypt.hashSync('1234', 8),
          isAdmin: false,
        },
      ],
    products:[
        {
            // _id:'1',
            name: 'פינגר ליים ירוק',
            catagory: 'פירות הדר',
            image:'/images/fingerLimeGreen.jpg',
            price: 19,
            owner:'ניריון',
            countInStock: 10,
            description:'פינגר ליים או ליים קוויאר ניתן לו בגלל שהפרי מורכב מכדוריות שקופות המזכירות קוויאר. הכדוריות יכולות להופיע בצבעים צהוב, כתום, אדום או ירוק. הקליפה מופיעה בצבעים ירוק, חום-אדום, כתום או שחור, כאשר צבע הקליפה לא תמיד מעיד על הצבע של החלק הפנימי, של הכדוריות'
        },
        {
            // _id:'2',
            name: 'פינגר ליים אדום',
            catagory: 'פירות הדר',
            image:'/images/red-sampanya-finger-lime.jpg',
            price: 19,
            owner:'ניריון',
            countInStock: 10,
            description:'פינגר ליים או ליים קוויאר ניתן לו בגלל שהפרי מורכב מכדוריות שקופות המזכירות קוויאר. הכדוריות יכולות להופיע בצבעים צהוב, כתום, אדום או ירוק. הקליפה מופיעה בצבעים ירוק, חום-אדום, כתום או שחור, כאשר צבע הקליפה לא תמיד מעיד על הצבע של החלק הפנימי, של הכדוריות'
        },
        {
            // _id:'3',
            name: 'פינגר ליים צהוב',
            catagory: 'פירות הדר',
            image:'/images/sari-finger-lime.jpg',
            price: 19,
            owner: ' ניריון',
            countInStock: 10,
            description:'פינגר ליים או ליים קוויאר ניתן לו בגלל שהפרי מורכב מכדוריות שקופות המזכירות קוויאר. הכדוריות יכולות להופיע בצבעים צהוב, כתום, אדום או ירוק. הקליפה מופיעה בצבעים ירוק, חום-אדום, כתום או שחור, כאשר צבע הקליפה לא תמיד מעיד על הצבע של החלק הפנימי, של הכדוריות'
        },
        {
            // _id:'4',
            name: 'לימון מאייר',
            catagory: 'פירות הדר',
            image:'/images/meyer-limon.jpg',
            price: 19,
            owner:'ניריון',
            countInStock: 10,
            description:'לימון מאייר נוצר מהכלאה בין לימון לתפוז, והתוצאה היא לימון כתום בעל ארומה עשירה מאוד וקליפה דקה יחסית, לחובבי מטבח: מלימון מאייר יוצאות עוגיות לימון מושלמות!'
        },
        {
            // _id:'5',
            name: 'לימון קאפיר',
            catagory: 'פירות הדר',
            image:'/images/kaffir-lime.jpg',
            price: 19,
            owner:'ניריון',
            countInStock: 10,
            description:'לפרי הקפיר ליים יש מיץ מאוד חמוץ ודומיננטי וצריך לדעת להשתמש בו לבישול. בקליפת הפרי משתמשים לפעמים להכנת משחות קארי, ובתעשיית הקוסמטיקה משתמשים בעלים ובפרי לבישום ולמלחמה בקשקשים, העלים של הצמח מאוד פופולריים במאכלים מהמזרח הרחוק.'
        },
        {
            // _id:'6',
            name: 'אצבעות בודהה',
            catagory: 'פירות הדר',
            image:'/images/budanin-lemon.jpg',
            price: 19,
            owner:'ניריון',
            countInStock: 10,
            description:'פרי יד הבודהה ריחני מאוד והוא משמש בעיקר בסין, מלזיה ויפן בשביל לבשם חדרים ופריטים אישיים כגון בגדים, בניגוד לפירות הדר אחרים, רוב הזנים של יד הבודהה אינם מכילים ציפה (החלק הבשרני של הפרי) או מיץ. על-אף שהפרי מוערך בעיקר בזכות צורתו והארומה שלו, את פירות יד הבודהה אפשר גם לאכול (לרוב בצורת גרידה של הקליפה או כתיבול) בקינוחים, מאכלים מלוחים, משקאות חריפים (כגון וודקה) או כממתקים (פירות מסוכרים).'
        }
    ]
};

export default data;